Date.prototype.format = function(fmt) {
	var o = {
		"M+" : this.getMonth() + 1, //月份
		"d+" : this.getDate(), //日
		"h+" : this.getHours(), //小时
		"m+" : this.getMinutes(), //分
		"s+" : this.getSeconds(), //秒
		"q+" : Math.floor((this.getMonth() + 3) / 3), //季度
		"S" : this.getMilliseconds() //毫秒
	};
	if (/(y+)/.test(fmt))
		fmt = fmt.replace(RegExp.$1, (this.getFullYear() + "").substr(4 - RegExp.$1.length));
	for (var k in o)
		if (new RegExp("(" + k + ")").test(fmt))
			fmt = fmt.replace(RegExp.$1, (RegExp.$1.length == 1) ? (o[k]) : (("00" + o[k]).substr(("" + o[k]).length)));
	return fmt;
}
//周次，日期；
var zcrqstr = "20200224,1;20200225,1;20200226,1;20200227,1;20200228,1;20200229,1;20200301,1;20200302,2;20200303,2;20200304,2;20200305,2;20200306,2;20200307,2;20200308,2;20200309,3;20200310,3;20200311,3;20200312,3;20200313,3;20200314,3;20200315,3;20200316,4;20200317,4;20200318,4;20200319,4;20200320,4;20200321,4;20200322,4;20200323,5;20200324,5;20200325,5;20200326,5;20200327,5;20200328,5;20200329,5;20200330,6;20200331,6;20200401,6;20200402,6;20200403,6;20200404,6;20200405,6;20200406,7;20200407,7;20200408,7;20200409,7;20200410,7;20200411,7;20200412,7;20200413,8;20200414,8;20200415,8;20200416,8;20200417,8;20200418,8;20200419,8;20200420,9;20200421,9;20200422,9;20200423,9;20200424,9;20200425,9;20200426,9;20200427,10;20200428,10;20200429,10;20200430,10;20200501,10;20200502,10;20200503,10;20200504,11;20200505,11;20200506,11;20200507,11;20200508,11;20200509,11;20200510,11;20200511,12;20200512,12;20200513,12;20200514,12;20200515,12;20200516,12;20200517,12;20200518,13;20200519,13;20200520,13;20200521,13;20200522,13;20200523,13;20200524,13;20200525,14;20200526,14;20200527,14;20200528,14;20200529,14;20200530,14;20200531,14;20200601,15;20200602,15;20200603,15;20200604,15;20200605,15;20200606,15;20200607,15;20200608,16;20200609,16;20200610,16;20200611,16;20200612,16;20200613,16;20200614,16;20200615,17;20200616,17;20200617,17;20200618,17;20200619,17;20200620,17;20200621,17;20200622,18;20200623,18;20200624,18;20200625,18;20200626,18;20200627,18;20200628,18;20200629,19;20200630,19;20200701,19;20200702,19;20200703,19;20200704,19;20200705,19;20200706,20;20200707,20;20200708,20;20200709,20;20200710,20;20200711,20;20200712,20;20200713,21;20200714,21;20200715,21;20200716,21;20200717,21;20200718,21;20200719,21;20200720,22;20200721,22;20200722,22;20200723,22;20200724,22;20200725,22;20200726,22";
var zc_rq_map = new Map()
var rq_zc_map = new Map()
for(var i=0;i<zcrqstr.split(";").length;i++){
	var rq = zcrqstr.split(";")[i].split(",")[0];
	var zc = zcrqstr.split(";")[i].split(",")[1];
	if(zc_rq_map.get(zc)==null){
		zc_rq_map.set(zc, rq);
	}else{
		zc_rq_map.set(zc, zc_rq_map.get(zc)+","+rq);
	}
	rq_zc_map.set(rq, zc);
}
var todayStr = new Date().format("yyyyMMdd");
var zc = rq_zc_map.get(todayStr);

//周次对应的日期
var rqArr = new Array(7);
for(var i=0;i<zc_rq_map.get(zc).split(",").length;i++){
	rqArr[i]=zc_rq_map.get(zc).split(",")[i].substr(4,2)+"/"+zc_rq_map.get(zc).split(",")[i].substr(6,2);
}

var week = [ '周一', '周二', '周三', '周四', '周五', '周六', '周日' ];
var courseType = [
	[ {
		index : '1',
		name : '08:00\n08:45'
	}, 1 ],
	[ {
		index : '2',
		name : '08:55\n09:40'
	}, 1 ],
	[ {
		index : '3',
		name : '09:55\n10:40'
	}, 1 ],
	[ {
		index : '4',
		name : '10:45\n11:30'
	}, 1 ],
	[ {
		index : '5',
		name : '11:35\n12:20'
	}, 1 ],
	[ {
		index : '6',
		name : '14:30\n15:15'
	}, 1 ],
	[ {
		index : '7',
		name : '15:20\n16:05'
	}, 1 ],
	[ {
		index : '8',
		name : '16:20\n17:05'
	}, 1 ],
	[ {
		index : '9',
		name : '17:10\n17:55'
	}, 1 ],
	[ {
		index : '10',
		name : '19:00\n19:45'
	}, 1 ],
	[ {
		index : '11',
		name : '19:50\n20:35'
	}, 1 ],
	[ {
		index : '12',
		name : '20:40\n21:25'
	}, 1 ]
];

var courseListArr = [[
	[ '文学概论@教2-210', '文学概论@教2-210', '中国古代文学﹙Ⅲ﹚@教2-212', '中国古代文学﹙Ⅲ﹚@教2-212', '中国古代文学﹙Ⅲ﹚@教2-212','', '', '文艺学经典导读@教2-213', '文艺学经典导读@教2-213',  '', '', '' ],
	[ '', '', '秘书学概论@教2-217', '秘书学概论@教2-217', '秘书学概论@教2-217', '口才训练@教科302', '口才训练@教科302', '大学英语(III) 读写译@教1-214', '大学英语(III) 读写译@教1-214', '普通话训练与演讲@教2-217', '普通话训练与演讲@教2-217', '普通话训练与演讲@教2-217' ],
	[ '基础写作@教2-107', '基础写作@教2-107', '现代汉语@建树A-103', '现代汉语@建树A-103', '现代汉语@建树A-103', '','', '《论语》研读@教2-210', '《论语》研读@教2-210', '现代交际礼仪学@教2-120', '现代交际礼仪学@教2-120', '现代交际礼仪学@教2-120' ],
	[ '新闻写作@教2-210', '新闻写作@教2-210', '魏晋玄学与文学@教2-210', '魏晋玄学与文学@教2-210', '', '思想道德修养与法律基础@教2-117', '思想道德修养与法律基础@教2-117', '专业导论@教1-102', '专业导论@教1-102', '', '', '' ],
	[ '外国文学@教2-210', '外国文学@教2-210', '古代汉语 (Ⅰ) @教1-201', '古代汉语 (Ⅰ) @教1-201', '古代汉语 (Ⅰ) @教1-201', '', '', '毛泽东思想和中国特色社会主义理论体系概论(Ⅰ)@教科206', '毛泽东思想和中国特色社会主义理论体系概论(Ⅰ)@教科206', '创业基础@教1-119', '创业基础@教1-119', '创业基础@教1-119' ],
	[ '大学计算机@实C-307', '大学计算机@实C-307', '大学计算机@实C-307', '大学计算机@实C-307', '', '体育保健课@西体育场', '体育保健课@西体育场', '', '', '', '', '' ],
	[ '', '', '', '', '', '', '', '', '', '', '', '' ]
],[
	[ '文学概论@教2-210', '文学概论@教2-210', '中国古代文学﹙Ⅲ﹚@教2-212', '中国古代文学﹙Ⅲ﹚@教2-212', '中国古代文学﹙Ⅲ﹚@教2-212', '', '', '', '', '', '', '' ],
	[  '秘书学概论@教2-217', '秘书学概论@教2-217', '秘书学概论@教2-217','', '', '口才训练@教科302', '口才训练@教科302', '大学英语(III) 读写译@教1-214', '大学英语(III) 读写译@教1-214', '普通话训练与演讲@教2-217', '普通话训练与演讲@教2-217', '普通话训练与演讲@教2-217' ],
	[ '新闻写作@教2-210', '新闻写作@教2-210', '魏晋玄学与文学@教2-210', '魏晋玄学与文学@教2-210', '', '思想道德修养与法律基础@教2-117', '思想道德修养与法律基础@教2-117', '专业导论@教1-102', '专业导论@教1-102', '', '', '' ],
	[ '基础写作@教2-107', '基础写作@教2-107', '现代汉语@建树A-103', '现代汉语@建树A-103', '现代汉语@建树A-103', '文艺学经典导读@教2-213', '文艺学经典导读@教2-213', '《论语》研读@教2-210', '《论语》研读@教2-210', '现代交际礼仪学@教2-120', '现代交际礼仪学@教2-120', '现代交际礼仪学@教2-120' ],
	[ '外国文学@教2-210', '外国文学@教2-210', '古代汉语 (Ⅰ) @教1-201', '古代汉语 (Ⅰ) @教1-201', '古代汉语 (Ⅰ) @教1-201', '', '', '毛泽东思想和中国特色社会主义理论体系概论(Ⅰ)@教科206', '毛泽东思想和中国特色社会主义理论体系概论(Ⅰ)@教科206', '创业基础@教1-119', '创业基础@教1-119', '创业基础@教1-119' ],
	[ '', '', '', '', '', '体育保健课@西体育场', '体育保健课@西体育场', '', '', '', '', '' ],
	[ '', '', '', '', '', '', '', '', '', '', '', '' ]
]];
// 实例化(初始化课表)
var Timetable = new Timetables({
	el : '#coursesTable',
	timetables : courseListArr[0],
	week : week,
	dayArr : rqArr,
	timetableType : courseType,
	highlightWeek : new Date().getDay(),
	gridOnClick : function(e) {
	},
	styles : {
		Gheight : 50
	}
});

//切换课表
function changeKeChengBiao(zc,indexflag) {
	console.log(zc);
	//周次对应的日期
	for(var i=0;i<zc_rq_map.get(zc).split(",").length;i++){
		rqArr[i]=zc_rq_map.get(zc).split(",")[i].substr(4,2)+"/"+zc_rq_map.get(zc).split(",")[i].substr(6,2);
	}
	Timetable.setOption({
		timetables : courseListArr[indexflag],
		week : week,
		dayArr : rqArr,
		timetableType : courseType,
		highlightWeek : new Date().getDay(),
		gridOnClick : function(e) {
			//alert(e.name + '  ' + e.week + ', 第' + e.index + '节课, 课长' + e.length + '节');
			if (e.name != '') {
				$.modal({
					//title : e.week + '第' + e.index + '节',
					text : e.name,
					buttons : [
						{
							text : "关闭",
							className : "default"
						},
					]
				});
			}
		},
		styles : {
			Gheight : 50
		}
	});
}


var indexflag = 1;
var swiper = new Swiper('.swiper-container', {
	centeredSlides : true,
	slidesPerView : 5,
	initialSlide : (zc-1),

	navigation : {
		nextEl : '.swiper-button-next',
		prevEl : '.swiper-button-prev',
	},
	effect : 'coverflow', //可以实现3D效果的轮播,
	coverflowEffect : {
		rotate : 30, //slide做3d旋转时Y轴的旋转角度。默认50。
		stretch : 0, //每个slide之间的拉伸值，越大slide靠得越紧。 默认0。
		depth : 40, //slide的位置深度。值越大z轴距离越远，看起来越小。 默认100。
		modifier : 1, //depth和rotate和stretch的倍率，相当于depth*modifier、rotate*modifier、stretch*modifier，值越大这三个参数的效果越明显。默认1。
		slideShadows : false, //开启slide阴影。默认 true。
	},
	on : {
		transitionEnd : function(event) {
			var zc = (this.activeIndex+1)+"";
			//你的事件
			if (indexflag == 1) {
				indexflag = 2;
				changeKeChengBiao(zc,indexflag);
			} else {
				indexflag = 1;
				changeKeChengBiao(zc,indexflag);
			}

		},
	}
});
